RIET/src/Catalogs/SLSRCA/SLSRCA.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SLSRCA</name>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AllowDifferenceInCountries</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionSpecialist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Segments</name>
    <attributes>
      <name>Segment</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ProcessLevels</name>
    <attributes>
      <name>ProcessLevel</name>
      <type>
        <types>CatalogRef.ProcessLevels</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/SLSRCA/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////
// ПРИ КОПИРОВАНИИ

Процедура ПриКопировании(ОбъектКопирования)
	
	РГСофт.ОчиститьCreationModification(ЭтотОбъект);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизиты();
	
	ПроверитьРеквизиты(Отказ);
	
КонецПроцедуры

Процедура ДозаполнитьРеквизиты()
	
	Код = СокрЛП(Код);
	Наименование = СокрЛП(Наименование);
	Phone = СокрЛП(Phone);
	EMail = СокрЛП(EMail);
	
	Если ЗначениеЗаполнено(ProcessLevel) Тогда
		Country = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ProcessLevel, "Country");
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		РГСофт.ЗаполнитьCreation(ЭтотОбъект);
	КонецЕсли;
	
	ProcessLevels.Свернуть("ProcessLevel");
	Segments.Свернуть("Segment");
	
КонецПроцедуры

Процедура ПроверитьРеквизиты(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Alias' is empty!",
			ЭтотОбъект, "Код",, Отказ);		
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Name' is empty!",
			ЭтотОбъект, "Наименование",, Отказ);		
	КонецЕсли;	
	        		
	Если НЕ ЗначениеЗаполнено(Phone) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Phone' is empty!",
			ЭтотОбъект, "Phone",, Отказ);		
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(EMail) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'E-mail' is empty!",
			ЭтотОбъект, "EMail",, Отказ);		
	КонецЕсли;	
	
	//Если НЕ ЗначениеЗаполнено(ProcessLevel) Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		"'Process level' is empty!",
	//		ЭтотОбъект, "ProcessLevel", , Отказ);
	//КонецЕсли;
	
	Если Не TransactionSpecialist Тогда 
		
		Если ProcessLevels.Количество() = 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Add at least one process level!",
			ЭтотОбъект, "ProcessLevels",, Отказ);		
		КонецЕсли;
		
		Если Segments.Количество() = 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Add at least one segment!",
			ЭтотОбъект, "Segments",, Отказ);		
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры
